Repository: Keilith-L/appcenter
Catalog: po/extra/*.po
Languages: mr

source: AppCenter
mr: अनुप्रयोग भांडार(अॅप सेंटर)

source: Browse and manage apps
mr: ब्राउझ करा आणि अॅप्स व्यवस्थापित करा

source: Updated translations
mr: अद्ययावत भाषांतर

source: Fixes
mr: निराकारणे

source: Correctly display names of Flatpak runtime updates
mr: फ्लॅटपाक रनटाइम अद्यतनांची नावे योग्यरित्या प्रदर्शित करा

source: Minor updates
mr: किरकोळ अद्यतने

source: New features
mr: नवीन वैशिष्टये

source: Support system-wide Flatpak remotes
mr: सिस्टम-व्यापी फ्लॅटपाक रीमोट समर्थन

source: Fix Flatpak runtime updates getting stuck
mr: फ्लॅटपाक रनटाइम अद्यतने अडकल्याची निराकरण करा

source: Fix long origin comboboxes breaking the header layout
mr: शीर्षलेख लेआउट ब्रेकिंग लाँग ओरिजन कॉम्बोबॉक्सेसशी संबंधित समस्यांचे निराकरण करा

source: When apps are available from multiple sources, prefer installed version, then prefer Flatpak
mr: जेव्हा अ‍ॅप एकाधिक स्रोतांकडून उपलब्ध असतात, तेव्हा स्थापित केलेली आवृत्ती पसंत करा, नंतर फ्लॅटपॅकला प्राधान्य द्या

source: Improve search performance
mr: शोध कार्यप्रदर्शन सुधारित करा

source: Improve update badge styling and category styling
mr: अद्यतन बॅज स्टाईलिंग आणि श्रेणी शैली सुधारित करा

source: Ensure AppCenter is reopened at the correct position
mr: अ‍ॅप सेंटर योग्य ठिकाणी पुन्हा सुरू केले आहे याची खात्री करा

source: Clicking the updates badge in the header navigates to the updates view
mr: शीर्षलेखातील अद्यतनांचा बॅज क्लिक करणे "अद्ययावत करा" दृश्यावर नेव्हिगेट करते

source: Ensure all updatable Flatpak runtimes are listed for update
mr: अद्यतनासाठी सर्व अद्ययावत फ्लॅटपाक रनटाइम सूचीबद्ध असल्याचे सुनिश्चित करा

source: Performance improvements
mr: कार्यक्षमता सुधारणा

source: Perform updates without administrator permissions
mr: प्रशासकाच्या परवानगीशिवाय अद्यतने करा

source: Ensure apps on the homepage are more reliably displayed
mr: मुख्यपृष्ठावरील अ‍ॅप्स अधिक विश्वासार्हपणे प्रदर्शित केल्याची खात्री करा

source: More reliably set the Dock badge number
mr: अधिक विश्वसनीयरित्या डॉक बॅज क्रमांक सेट करा

source: Only check for updates at device startup if it's more than 24 hours since we last checked
mr: आम्ही शेवटच्या वेळी तपासणी केल्यापासून 24 तासांपेक्षा जास्त वेळ असल्यास केवळ डिव्हाइस स्टार्टअपवरील अद्यतनांसाठी तपासणी करा

source: Reduce slowdowns when opening certain apps
mr: विशिष्ट अ‍ॅप्‍स उघडताना येणारी मंदी कमी करा

source: Extension improvements
mr: विस्तार सुधारणा

source: To de-clutter the updates view, extensions are now only shown if they require updates
mr: अद्यतनांचे दृश्य अ-गोंधळ करण्यासाठी, विस्तारांना केवळ अद्यतनांची आवश्यकता असल्यासच ते दर्शविले जातात

source: Clicking an extension on an app's info page now shows details for the extension
mr: अ‍ॅपच्या माहिती पृष्ठावर विस्तार क्लिक करणे आता विस्तारासाठी तपशील दर्शविते

source: Swap the main and overlay icons for extensions to more clearly associate extensions with their app
mr: विस्तारासाठी त्यांच्या अ‍ॅपसह अधिक स्पष्टपणे संबद्ध करण्यासाठी मुख्य आणि आच्छादित चिन्हे स्वॅप करा

source: Keyboard improvements
mr: कीबोर्ड सुधारणा

source: Pressing down in the search field moves the keyboard focus to the search results list
mr: शोध फील्डमध्ये डाउन की दाबल्याने कीबोर्ड फोकस शोध परिणाम सूचीकडे जाईल

source: Ctrl+F now moves the cursor to the search field
mr: Ctrl + F आता कर्सरला शोध क्षेत्रामध्ये हलवते

source: Use configured network proxy settings for apt operations
mr: योग्य ऑपरेशन्ससाठी कॉन्फिगर केलेली नेटवर्क प्रॉक्सी सेटिंग्ज वापरा

source: No longer prompt for approval to update non-curated apps
mr: यापुढे नॉन-क्युरेटेड अ‍ॅप्स अद्यतनित करण्यासाठी लागणाऱ्या मंजूरीसाठी प्रॉमप्ट नाही

source: Ensure the OS updates subheading copy is correct after finishing updates
mr: अद्यतने पूर्ण केल्यावर ओएस अद्यतनांची उपशीर्षक कॉपी योग्य असल्याचे सुनिश्चित करा

source: Ellipsize long app names in App Info views
mr: अ‍ॅप माहिती दृश्यांमधील अ‍ॅप्सची मोठी असलेली नावे लंबवर्तुळाकार करा

source: And more
mr: आणि अधिक

source: Show a more informative loading screen when checking for updates
mr: अद्यतनांची तपासणी करताना अधिक माहितीपूर्ण लोडिंग स्क्रीन दर्शवा

source: Don't list fonts alongside apps
mr: अ‍ॅप्ससह फॉन्टची यादी करू नका

source: Prevent crashes when updating Flatpaks and system packages simultaneously
mr: फ्लॅटपॅक्स आणि सिस्टम पॅकेजेस एकाचवेळी अद्यतनित करताना क्रॅश होण्यापासून प्रतिबंधित करा

source: Prevent suspending when installing, updating, or removing packages
mr: पॅकेजेस स्थापित करताना, अद्यतनित करताना किंवा काढून टाकताना निलंबन प्रतिबंधित करा

source: Minor fixes
mr: किरकोळ दोष निराकरणे

source: Update application details when changes happen outside of AppCenter
mr: अ‍ॅपसेन्टरच्या बाहेर बदल झाल्यावर अनुप्रयोग तपशील अद्यतनित करा

source: Fix for notification not appearing when a restart is required
mr: रीस्टार्ट आवश्यक असताना सूचना न दिल्यास त्याचे निराकरण करा

source: Apps in list views now load in the correct order when scrolling
mr: सूची दृश्यांमधील अ‍ॅप्स आता स्क्रोल करताना योग्य क्रमाने लोड केले जातात

source: Prevent unescaped XML entities from appearing in application names
mr: अनुप्रयोगावरील नावे दिसण्यापासून न वाचलेल्या XML घटकांना प्रतिबंधित करा

source: Load the "Installed" view faster
mr: "Installed" दृश्य जलद लोड करा

source: Ensure flatpak applications show in the category views
mr: श्रेणी दृश्यांमध्ये फ्लॅटपॅक अनुप्रयोग दाखविल्याची खात्री करा

source: Save some bandwidth by downloading smaller screenshots where appropriate
mr: गरजेप्रमाणे लहान स्क्रीनशॉट्स डाउनलोड करुन काही बँडविड्थ जतन करा

source: System components no longer have an "Open" button
mr: सिस्टम घटकांकडे आता "उघडा" बटण नसते

source: Applications menu can now remove flatpaks that weren't installed by AppCenter
mr: अ‍ॅप्लिकेशन्स मेनू आता अ‍ॅपसेन्टरद्वारे स्थापित न केलेले फ्लॅटपॅक काढू शकतो

source: Make download size estimates more accurate
mr: डाउनलोड आकार अंदाज अधिक अचूक करा

source: Prevent AppCenter from opening on log in
mr: लॉग इन होताच उघडण्यापासून AppCenter ला प्रतिबंधित करा

source: Prevent ghost update notification when there are no updates available
mr: कोणतीही अद्यतने उपलब्ध नसताना घोस्ट अद्यतन सूचना प्रतिबंधित करा

source: Show correct installation state for extensions
mr: विस्तारांसाठी योग्य स्थापना स्थिती दर्शवा

source: Add support for Flatpak apps
mr: फ्लॅटपॅक अ‍ॅप्ससाठी समर्थन जोडा

source: Warn about non-curated apps
mr: क्यूरेट न केलेल्या अ‍ॅप्सबद्दल चेतावणी द्या

source: Show an error dialog if an installation fails
mr: स्थापना अयशस्वी झाल्यास त्रुटी संवाद दर्शवा

source: Fix an issue where some apps couldn't be uninstalled from the Applications Menu
mr: अनुप्रयोग मेनूमधून काही अॅप्स विस्थापित केले जाऊ शकत नाहीत अशा समस्येचे निराकरण करा

source: Allow browsing and uninstalling apps while offline
mr: ऑफलाइन असताना ब्राउझिंग आणि विस्थापित करणे यासाठी अ‍ॅप्सना अनुमती द्या

source: Fix twitter share URLs
mr: ट्विटर शेअर URL दुरुस्त करा

source: Drop Google+ from the share menu
mr: सामायिक मेनूमधून Google+ ड्रॉप करा

source: Animate screenshot background while loading
mr: लोड करताना स्क्रीनशॉट पार्श्वभूमी एनिमेट करा

source: Add navigation arrows for screenshots
mr: स्क्रीनशॉटसाठी नेव्हिगेशन बाण जोडा

source: Don't show uninstall buttons for essential system components
mr: आवश्यक सिस्टम घटकांसाठी विस्थापित बटणे दर्शवू नका

source: Properly display proprietary licenses
mr: मालकी परवाने योग्यरित्या प्रदर्शित करा

source: Fix some layout issues
mr: काही लेआउट समस्यांचे निराकरण करा

source: Fix crashes
mr: क्रॅश निराकरण करा

source: Meson build system fixes
mr: मेसन बिल्डचे सिस्टम फिक्स

source: Improve window state restoration
mr: विंडो स्थिती पुनर्संचयन सुधारित करा

source: Prevent action buttons from jumping around
mr: ऍक्शन बटणांना जंप अराउंड करण्यापासून प्रतिबंधित करा

source: Remove reset paid apps gsettings key
mr: रीसेट पेड ऍप्प जी सेटिंग की काढा

source: Memory management refinements
mr: मेमरी व्यवस्थापन परिष्करण

source: Add conditional compilation for disabling dynamic remote homepage content
mr: डायनॅमिक रिमोट मुख्यपृष्ठ सामग्री अक्षम करण्यासाठी सशर्त संकलन जोडा

source: New translations
mr: नवीन अनुवाद

source: New categories: Communication, Finance, Media Production
mr: नवीन वर्गः संप्रेषण, वित्त, माध्यम उत्पादन

source: Add Math to Science category
mr: विज्ञान श्रेणीमध्ये गणित जोडा

source: Relax email address validator
mr: आरामदायक ईमेल पत्ता वैधता तपासक

source: Present update availability more accurately
mr: वर्तमान अद्यतन उपलब्धता अधिक अचूकपणे

source: Category graphics revamped
mr: सुधारित ग्राफिक्स श्रेणी

source: Bug fixes and improve performance.
mr: दोष निराकरण आणि कार्यप्रदर्शन सुधारित करा.

source: Improve transaction success rate
mr: व्यवहार यश दर सुधारित करा

source: Add Publishing to Office category
mr: कार्यालय श्रेणीमध्ये प्रकाशन जोडा

source: Improve descriptions of OS Updates
mr: ओएस अपडेट्सचे वर्णन सुधारा

source: Various bug fixes and performance improvements
mr: विविध दोष निराकरणे आणि कार्यक्षमता सुधारणा

source: Give details for Operating System Updates
mr: ऑपरेटिंग सिस्टम अद्यतनांसाठी तपशील द्या

source: Support mouse button navigation
mr: माऊस बटण नेव्हिगेशन समर्थन

source: Fix crash caused by entries with missing packages
mr: गहाळ पॅकेजेससह झालेल्या नोंदीमुळे होणारा क्रॅश दुरुस्त करा

source: Add capability to search by category and apply minor bug fixes.
mr: श्रेणीनुसार शोधण्याची क्षमता जोडा आणि किरकोळ दोष निराकरणे लागू करा.

source: It is now possible to search apps inside a category
mr: श्रेणीमध्ये अॅप्स शोधणे आता शक्य आहे

source: Prevent multiple authentication dialogs when resuming from suspend
mr: निलंबन पासून पुन्हा सुरू झाल्यावर एकाधिक प्रमाणीकरण संवाद टाळा

source: Search performance has been improved, the category name is now shown on the headbar and minor bugs have been fixed.
mr: शोध कार्यक्षमता सुधारित केली आहे, श्रेणी नाव आता हेडबारवर दर्शविले आहे आणि किरकोळ दोष निश्चित केले गेले आहेत.

source: Fix Steam installation
mr: स्टीम इंस्टॉलेशन दुरुस्त करा

source: Make search asynchronous
mr: शोध अतुल्यकालिक करा

source: elementary, Inc.
mr: एलिमेंटरी, Inc.

source: install;uninstall;remove;catalogue;store;apps;software;
mr: इन्स्टॉल; अनइन्स्टॉल; काढणे; कॅटलॉग; स्टोअर; अॅप्स; सॉफ्टवेअर;

source: Check for Updates
mr: अपडेट्ससाठी तपासा

source: Update software
mr: सॉफ्टवेअर अद्यतनित करा

source: Authentication is required to update software
mr: सॉफ्टवेअर अद्यतनित करण्यासाठी प्रमाणीकरण आवश्यक आहे
